# AllMembers Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeomCombination..::..AllMembers Property
GeomCombination Class See Also
---
All elements that are joined in this geometry combination.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CombinableElementArray AllMembers { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AllMembers As CombinableElementArray
	Get
```

Visual C++
---
```text
public:
property CombinableElementArray^ AllMembers {
	CombinableElementArray^ get ();
}
```

# Remarks
All members are generic forms, for more information, refer toGenericForm.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when this geometry combination has already been deleted. |

# See Also
GeomCombination Class
Autodesk.Revit.DB Namespace